Revit 2027 API
LoadComponent.Factor Property
 Load component factor.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Factor { get; set; }
Public Property Factor As Double
	Get
	Set
public:
property double Factor {
	double get ();
	void set (double value);
}
member Factor : float with get, set
Property Value
Double
See Also
Reference
LoadComponent Class
Autodesk.Revit.DB.Structure Namespace